In [2]:
import pandas as pd
import numpy as np
import scipy.stats
import os
import analysis_kit as ak

In [3]:
os.getcwd()

'C:\\Users\\user\\Documents\\Coursera'

In [4]:
ff_data=pd.read_csv("data\\Portfolios_Formed_on_ME_monthly_EW.csv", index_col=0, parse_dates=True, header=0,
                    na_values="-99.99")

In [5]:
ff_data.head()

,<= 0,Lo 30,Med 40,Hi 30,Lo 20,Qnt 2,Qnt 3,Qnt 4,Hi 20,Lo 10,Dec 2,Dec 3,Dec 4,Dec 5,Dec 6,Dec 7,Dec 8,Dec 9,Hi 10
192607,NaN,-0.43,1.52,2.68,-0.57,0.59,1.60,1.47,3.33,-1.45,0.29,-0.15,1.33,1.24,1.98,1.55,1.38,3.38,3.29
192608,NaN,3.90,3.04,2.09,3.84,3.59,3.71,1.61,2.33,5.12,2.59,4.03,3.15,2.72,4.72,1.60,1.63,0.98,3.70
192609,NaN,-1.08,-0.54,0.16,-0.48,-1.40,0.00,-0.50,-0.09,0.93,-1.87,-2.27,-0.53,0.07,-0.07,-1.64,0.64,-0.86,0.67
192610,NaN,-3.32,-3.52,-3.06,-3.29,-4.10,-2.89,-3.36,-2.95,-4.84,-1.77,-3.36,-4.83,-2.98,-2.80,-3.45,-3.27,-3.47,-2.43
192611,NaN,-0.46,3.82,3.09,-0.55,2.18,3.41,3.39,3.16,-0.78,-0.32,-0.29,4.65,3.24,3.57,3.82,2.95,3.61,2.70

In [6]:
columns=["Lo 20","Hi 20"]

In [7]:
rets=ff_data[columns]
rets.head()

        Lo 20  Hi 20
192607  -0.57   3.33
192608   3.84   2.33
192609  -0.48  -0.09
192610  -3.29  -2.95
192611  -0.55   3.16

In [8]:
rets=rets/100
rets.head()

         Lo 20   Hi 20
192607 -0.0057  0.0333
192608  0.0384  0.0233
192609 -0.0048 -0.0009
192610 -0.0329 -0.0295
192611 -0.0055  0.0316

##### What was the Annualized Return of the both Lo and Hi 20 portfolio over the entire period?

In [26]:
avgret=rets.mean()
avgret

Lo 20    0.015904
Hi 20    0.009434
dtype: float64

In [22]:
no_of_obs=rets.shape[0]

In [27]:
ret_per_month= (rets+1).prod()**(1/no_of_obs)-1
ret_per_month

Lo 20    0.011860
Hi 20    0.007859
dtype: float64

In [28]:
ann_ret=((1+ret_per_month)**12)-1
ann_ret

Lo 20    0.151977
Hi 20    0.098490
dtype: float64

### OR

In [29]:
ann_ret1=((1+rets).prod())**(12/no_of_obs)-1
ann_ret1

Lo 20    0.151977
Hi 20    0.098490
dtype: float64

#### So, the annualized return turns out to be 15.19%

### Annualized vol of Lo 20 portfolio

In [31]:
periodic_vol=rets.std()
periodic_vol

Lo 20    0.097197
Hi 20    0.056325
dtype: float64

In [33]:
ann_vol=periodic_vol*(12**0.5)
ann_vol

Lo 20    0.336701
Hi 20    0.195116
dtype: float64

#### What was the Annualized Volatility of the Lo 20 portfolio over the period 1999 - 2015 (both inclusive)?

In [34]:
rets.head()

         Lo 20   Hi 20
192607 -0.0057  0.0333
192608  0.0384  0.0233
192609 -0.0048 -0.0009
192610 -0.0329 -0.0295
192611 -0.0055  0.0316

In [37]:
# First change the index to a proper datetime df

rets.index=pd.to_datetime(rets.index, format="%Y%m").to_period("M")
rets.head()

          Lo 20   Hi 20
1926-07 -0.0057  0.0333
1926-08  0.0384  0.0233
1926-09 -0.0048 -0.0009
1926-10 -0.0329 -0.0295
1926-11 -0.0055  0.0316

In [41]:
periodic_vol=rets["1999":"2016"].std()
periodic_vol

Lo 20    0.065428
Hi 20    0.049052
dtype: float64

In [42]:
ann_vol=periodic_vol*(12**0.5)
ann_vol

Lo 20    0.226651
Hi 20    0.169922
dtype: float64

In [43]:
ret_per_period1=((1+rets["1999":"2016"]).prod())**(1/no_of_obs)-1
ret_per_period1

Lo 20    0.001805
Hi 20    0.001049
dtype: float64

In [47]:
ann_ret2=((1+ret_per_period1)**(12))-1
ann_ret2

Lo 20    0.021874
Hi 20    0.012659
dtype: float64

### OR

In [48]:
ann_ret3=((1+rets["1999":"2016"]).prod())**(12/no_of_obs)-1
ann_ret3

Lo 20    0.021874
Hi 20    0.012659
dtype: float64

### Max Drawdown